Repository: aticdon/SEP490_08_GestPipe_DesktopApplication
Catalog: GestPipePowerPonit/Properties/Resources.*.resx
Languages: vi_vn

# Btn_Browse
source: Browse File...
vi_vn: Chọn...

# Btn_CustomGesture
source: Custom Gesture
vi_vn: Tùy chỉnh cử chỉ

# Btn_GestureControl
source: Gesture Control
vi_vn: Quản lí cử chỉ

# Btn_Home
source: Home
vi_vn: Trang chủ

# Btn_Instruction
source: Instruction
vi_vn: Hướng dẫn

# Btn_Present
source: Presentation
vi_vn: Trình chiếu

# Btn_SlideShow
source: Slide Show
vi_vn: Bắt đầu trình chiếu

# Btn_Training
source: Training
vi_vn: Tập luyện

# Btn_Version
source: Version
vi_vn: Phiên bản

# Col_Accuracy
source: Accuracy
vi_vn: Độ Chỉnh Xác

# Col_LastUpdate
source: Last Update
vi_vn: Cập Nhật Cuối

# Col_Name
source: Gesture Name
vi_vn: Tên Cử Chỉ

# Col_Status
source: Status
vi_vn: Trạng Thái

# Col_Type
source: Gesture Type
vi_vn: Loại Cử Chỉ

# Home_Welcome
source: Welcome
vi_vn: Xin Chào

# LblClose
source: Close
vi_vn: Đóng

# LblDescription
source: Description
vi_vn: Mô tả

# LblDirection
source: Direction
vi_vn: Hướng chuyển động

# LblInstruction
source: Instruction
vi_vn: Hướng dẫn

# LblLeftHand
source: Left hand
vi_vn: Tay trái

# LblNote
source: Note
vi_vn: Ghi chú

# LblOpenFile
source: Open File:
vi_vn: Mở Thư Mục:

# LblRightHand
source: Right hand
vi_vn: Tay phải

# LblSubtitle
source: Do you want to present now?
vi_vn: Bạn có muốn thuyết trình bây giờ không?

# Lbl_Accuracy
source: Accuracy
vi_vn: Độ chính xác

# Lbl_Category
source: Select Presentation Category:
vi_vn: Chọn danh mục thuyết trình:

# Lbl_LastResult
source: Last Result
vi_vn: Kết quả cuối

# Lbl_PoseTarget
source: Pose Target
vi_vn: Động tác

# Lbl_PresentationPreview
source: Presentation Camera
vi_vn: Camera trình chiếu

# Lbl_PresentiontationFile
source: Presentation File
vi_vn: Thư Mục Trình Chiếu

# Lbl_Reason
source: Reason
vi_vn: Lý do

# Lbl_Result_Correct
source: Correct
vi_vn: Đúng

# Lbl_Result_Wrong
source: Wrong
vi_vn: Sai

# Lbl_Topic
source: Choose Presentation Type:
vi_vn: Chọn loại thuyết trình:

# Lbl_TrainingDay
source: Training time
vi_vn: Thời gian huấn luyện

# Lbl_TrainingResult
source: Training Result
vi_vn: Kết quả tập luyện

# Reason_InsufficientData
source: Insufficient data
vi_vn: Không đủ dữ liệu

# Reason_LowConfidence
source: Low confidence
vi_vn: Độ chính xác thấp

# Reason_MLError
source: ML error
vi_vn: Lỗi máy học (ML)

# Reason_MotionProcessingFailed
source: Motion processing failed
vi_vn: Xử lý chuyển động lỗi

# Reason_MotionSmall
source: Movement too small
vi_vn: Chuyển động quá nhỏ

# Reason_StaticDuration
source: Duration too short
vi_vn: Thời gian giữ quá ngắn

# Reason_StaticMotion
source: Still moving (not static enough)
vi_vn: Tay vẫn di chuyển

# Reason_TooFast
source: Too fast
vi_vn: Quá nhanh

# Reason_WrongAxis
source: Wrong axis of movement
vi_vn: Sai trục di chuyển

# Reason_WrongDirection
source: Wrong movement direction
vi_vn: Sai hướng di chuyển

# Message_LogoutConfirm
source: Are you sure you want to logout?
vi_vn: Bạn có chắc chắn muốn đăng xuất?

# Message_LogoutSuccess
source: Logged out successfully!
vi_vn: Đăng xuất thành công!

# Message_LogoutFailed
source: Failed to logout.
vi_vn: Đăng xuất thất bại.

# Message_LogoutError
source: Error during logout
vi_vn: Lỗi khi đăng xuất

# Title_Confirmation
source: Confirmation
vi_vn: Xác Nhận

# Title_Success
source: Success
vi_vn: Thành Công

# Title_Error
source: Error
vi_vn: Lỗi

# Title_ConnectionError
source: Connection Error
vi_vn: Lỗi Kết Nối

# ProfileForm_Title
source: My Profile
vi_vn: Hồ Sơ Của Tôi

# ProfileForm_BtnEdit
source: Edit Profile
vi_vn: Chỉnh Sửa

# ProfileForm_BtnSave
source: Save Changes
vi_vn: Lưu

# ProfileForm_BtnCancel
source: Cancel
vi_vn: Hủy

# ProfileForm_BtnChangePassword
source: Change Password
vi_vn: Đổi Mật Khẩu

# ProfileForm_BtnBack
source: Back
vi_vn: Quay Lại

# ProfileForm_FullName
source: Full Name
vi_vn: Họ và Tên

# ProfileForm_Phone
source: Phone Number
vi_vn: Số Điện Thoại

# ProfileForm_Gender
source: Gender
vi_vn: Giới Tính

# ProfileForm_BirthDate
source: Birth Date
vi_vn: Ngày Sinh

# ProfileForm_Address
source: Address
vi_vn: Địa Chỉ

# ProfileForm_Education
source: Education Level
vi_vn: Trình Độ Học Vấn

# ProfileForm_Company
source: Company
vi_vn: Công Ty

# ProfileForm_Occupation
source: Occupation
vi_vn: Nghề Nghiệp

# ProfileForm_Loading
source: Loading profile...
vi_vn: Đang tải hồ sơ...

# ProfileForm_Saving
source: Saving...
vi_vn: Đang lưu...

# Gender_Male
source: Male
vi_vn: Nam

# Gender_Female
source: Female
vi_vn: Nữ

# Gender_Other
source: Other
vi_vn: Khác

# Message_LoadProfileFailed
source: Failed to load profile.
vi_vn: Không thể tải hồ sơ.

# Message_ProfileUpdateSuccess
source: Profile updated successfully!
vi_vn: Cập nhật hồ sơ thành công!

# Message_ProfileUpdateFailed
source: Failed to update profile.
vi_vn: Cập nhật hồ sơ thất bại.

# Message_ChangeLanguageSuccess
source: Language changed successfully!
vi_vn: Đổi ngôn ngữ thành công!

# Message_ChangeLanguageFailed
source: Failed to change language
vi_vn: Không thể đổi ngôn ngữ

# CustomGesture_Title
source: 📋 Custom Gesture Instructions
vi_vn: 📋 Hướng Dẫn Thực Hiện

# CustomGesture_Instruction_01
source: 🎯 Keep hands within frame, 40–60 cm from camera
vi_vn: 🎯 Giữ tay trong khung hình, cách camera 40–60 cm

# CustomGesture_Instruction_02
source: ✋ Don't let hands go outside frame edges
vi_vn: ✋ Không để tay ra ngoài mép khung

# CustomGesture_Instruction_03
source: 💡 Ensure sufficient lighting
vi_vn: 💡 Đảm bảo đủ ánh sáng

# CustomGesture_Instruction_04
source: 📵 Don't let other objects cover hands
vi_vn: 📵 Không để vật thể khác che tay

# CustomGesture_Instruction_05
source: ⏱ Hold pose for 0.8–1.0 seconds for sample recording
vi_vn: ⏱ Giữ tư thế trong 0.8–1.0 giây để mẫu được ghi

# CustomGesture_Instruction_06
source: 🔄 Repeat 5 times to ensure sample quality
vi_vn: 🔄 Lặp lại 5 lần để đảm bảo chất lượng mẫu

# Btn_RequestGesture
source: Submit
vi_vn: Gửi

# Btn_Back
source: Previous
vi_vn: Quay lại

# lblRequest
source: Request Gesture
vi_vn: Gửi Yêu Cầu

# lblDesRequest
source: Description Request
vi_vn: Mô tả yêu cầu

# lblRequestDate
source: Request Date
vi_vn: Ngày Yêu Cầu

# lblStatus
source: Status
vi_vn: Trạng Thái

# BtnStartRequest
source: 🚀 Start Request
vi_vn: 🚀 Bắt đầu gửi

# lblRequestNumber
source: Number Gesture
vi_vn: Số Cử Chỉ

# lblDescriptionRequestPrefix
source: This request to update gestures:
vi_vn: Yêu cầu cập nhật các cử chỉ:

# RequestSuccessDetail
source: Request will send to Admin
vi_vn: Yêu câu sẽ được gửi đến Quản trị viên

# RequestSuccessTitle
source: Request Successful!
vi_vn: Gửi Thành Công

# RequestErrorDetail
source: An error occurred while making the request.
vi_vn: Đã xảy ra lỗi khi gửi yêu cầu.

# RequestErrorTitle
source: Request failed!
vi_vn: Gửi yêu cầu thất bại!

# BtnUserGesture
source: User Gesture
vi_vn: Cử chỉ cá nhân

# BtnDefaultGesture
source: Default Gesture
vi_vn: Cử chỉ mặc định

# List_Loading
source: Loading list gesture...
vi_vn: Đang tải danh sách cử chỉ...

# BtnStartRecord
source: 🚀Start Recording
vi_vn: 🚀Bắt đầu ghi

# BtnBack
source: Back
vi_vn: Quay lại

# ProfileForm_BtnBannerAdd
source: Update Info
vi_vn: Cập nhật
